Memento/src/DataProcessors/Editor/Editor.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Editor</name>
  <attributes>
    <name>Value</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Data</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Table</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Val</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Memento/src/DataProcessors/Editor/ObjectModule.bsl
#Region Public

Function CreateSnapshot() Export
	
	Self = New Structure;
	Self.Insert("Value", Value);
	Self.Insert("Data", Data);
	
	SerializedTable = New Array;
	For Each RowTable In Table Do
		Row = New Structure; 
		Row.Insert("Key", RowTable.Key);
		Row.Insert("Val", RowTable.Val);
		SerializedTable.Add(Row);
	EndDo;
	
	Self.Insert("Table", SerializedTable);
	
	Return Self;
	
EndFunction

#EndRegion
